export interface Video {
  title: string;
  id: string;
  description?: string;
}

export interface Series {
  id: string;
  name: string;
  description: string;
  imageUrl?: string;
  videos: Video[];
}

export const programsSeries: Series[] = [
  {
    id: 'series-1',
    name: ' الشيخ أحمد العربي ',
    description: 'سلسلة إيمانية رمضانية مميزة',
    imageUrl: '',
    videos: [
      { 
        title: 'الحلقة 1 – ماذا اريد من رمضان  ', 
        id: '35dxmgthnPM',
        description: 'شرح ماذا أريد من رمضان؟ د. أحمد العربي - الشيخ هيثم الدخين الصيام في الإسلام'
      },
      { 
        title: 'الحلقة 2 – كيف نصل إلى القلب السليم؟ ', 
        id: 'ZWraKKwNfpE',
        description: 'تأثير كيف نصل إلى القلب السليم؟ | د.أحمد العربي | بودكاست بدون ورق الكريم على النفس'
      },
      { 
        title: 'الحلقة 3 – الصلاة ', 
        id: '63_AOCldyXo',
        description: 'فضائل شهر فاهم 36 | سلسلة تذوق العبادات - (1) الصلاة | مع د. أحمد العربي المبارك'
      },
      { 
        title: 'الحلقة 4 – القرآن  ', 
        id: 'hK-9Be0prrA',
        description: 'شرح أحكام "أنا صاحِبُك القرآن" كيف يكون القرآن صاحبي؟ مع د. أحمد العربي والصدقة'
      },
      { 
        title: 'الحلقة 5 – الدعاء  ', 
        id: 'si994Z9BAr8',
        description: 'فاهم 38 | سلسلة تذوق العبادات - (3) الدعاء | مع د. أحمد العربي د. أحمد العربي والصدقة'
      },
      { 
        title: 'الحلقة 6 – كيف يكون القرآن صاحبي؟ ', 
        id: 'lkX6mcCD3CI',
        description: 'شرح أحكام "أنا صاحِبُك القرآن" كيف يكون القرآن صاحبي؟ مع د. أحمد العربي والصدقة'
      },
      { 
        title: 'الحلقة 7 – الذكر    ', 
        id: 'nkil1U1GxdA?',
        description: 'فاهم 42 | سلسلة تذوق العبادات - (4) الذكر | مع د. أحمد العربي'
      },
      { 
        title: 'الحلقة 8 – كيف   تصلي بقلبك ؟  ', 
        id: 'Uw7F06tvMng',
        description: 'كيف تتلذذ بالصلاة وتخشع فيها؟ أسرار ستغير صلاتك للأبد 🌷🤍'
      }
    ]
  },
  {
    id: 'series-2',
    name: 'الشيخ أمجد سمير ',
    description: 'سلسلة إيمانية رمضانية مميزة',
    imageUrl: '',
    videos: [
      { 
        title: 'منزلة التوبة (١)', 
        id: 'aCFez-PtOKw',
        description: 'منزلة التوبة (١) | سلسلة الاستعداد لرمضان ١٤٤٧'
      },
      { 
        title: 'منزلة التوبة (٢)', 
        id: 'Kt1Qor1jwZI',
        description: 'منزلة التوبة (٢) |  سلسلة الاستعداد لرمضان ١٤٤٧'
      },
      { 
        title: 'منزلة اليقظة', 
        id: 'nzQzzYdNI_g',
        description: 'منزلة اليقظة | سلسلة الاستعداد لرمضان ١٤٤٧'
      },
      { 
        title: 'فلسفة الصوم', 
        id: 'uTj3yNF79YI',
        description: 'فلسفة الصوم | مع الشيخ/ أمجد سمير'
      },
      { 
        title: 'غض البصر | الدرس الأول', 
        id: 'PmpfSBNnKAo',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | غض البصر | الدرس الأول'
      },
      { 
        title: 'غض البصر | الدرس الثاني', 
        id: 'rsyja8usgKc',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | غض البصر | الدرس الأول'
      },
      { 
        title: 'رمضان الجوع', 
        id: '8vStDmF-mgM',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | رمضان الجوع'
      },
      { 
        title: 'الرجاء في رحمة الله', 
        id: 'HeQwk6yWdLk',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | الرجاء في رحمة الله'
      },
      { 
        title: 'الشكر في رمضان', 
        id: 'MX_GajAmDBk',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | الشكر في رمضان'
      },
      { 
        title: 'دين ودنيا', 
        id: 'nXyyaUk68ZY',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | دين ودنيا'
      },
      { 
        title: 'إني عبدك', 
        id: 'H-Sqw_HV6eQ',
        description: ' سلسلة الاستعداد لرمضان ١٤٤٧ | إني عبدك'
      }
      
    ]
  },
  {
    id: 'series-3',
    name: ' عالمغرب مع الدكتور امير منير و الشيخ محمد الغليظ و الداعية ياسر ممدوح ',
    description: 'اي المشكله ؟',
    imageUrl: '',
    videos: [
      { 
        title: 'عالمغرب ليلة 1 رمضان', 
        id: 'Yx88r8QcsoU',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 2 رمضان', 
        id: 'uzxbkASMcZs',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 3 رمضان', 
        id: '0k_jXol-Niw',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 4 رمضان', 
        id: 'a_K369tvtfc',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 5 رمضان', 
        id: 'a8vQbOvDvd0',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 6 رمضان', 
        id: 'yK_5emjADag',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 7 رمضان', 
        id: 'lcFg9khZNsA',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 8 رمضان', 
        id: '143eONlITjg',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 9 رمضان', 
        id: 'Ca2XD3HG26M',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 10 رمضان', 
        id: 'FGnC0wb_hOk',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 11 رمضان', 
        id: 'T3tDgTtY5EM',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 12 رمضان', 
        id: 'ORhIQnOTJ40',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 13 رمضان', 
        id: 'Yx88r8QcsoU',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 14 رمضان', 
        id: '9ssU1i711uo',
        description: 'ايه اليوم '
      },
      { 
        title: 'عالمغرب ليلة 15 رمضان', 
        id: 'VBhMnlglSgY',
        description: 'ايه اليوم '
      },

    ]
  },
  {
    id: 'series-4',
    name: 'السيرة النبوية مع أحمد عامر ',
    description: 'دروس تفصيلية في السيرة النبوية',
    imageUrl: '',
    videos: [
      { 
        title: 'االدرس الأول- العالم قبل الإسلام', 
        id: 'LI99lWP1zac',
        description: 'شرح أركان الإيمان الستة'
      },
      { 
        title: 'الدرس الثاني- مولد النبي وبداية شبابه', 
        id: 'A6_y0HuwSQw',
        description: 'السيرة النبوية -الدرس الثاني- مولد النبي وبداية شبابه'
      },
      { 
        title: 'الدرس الثالث الجزء الأول- وصف النبي صلي الله عليه وسلم وزواجه من السيدة خديجة', 
        id: 'nqpVIANGU-o',
        description: 'سلسلة السيرة النبوية -الدرس الثالث الجزء الأول- وصف النبي صلي الله عليه وسلم وزواجه من السيدة خديجة'
      },
      { 
        title: 'الدرس الثالث الجزء الثاني- وصف النبي صلي الله عليه وسلم وزواجه من السيدة خديجة', 
        id: 'YdWK45slrqc',
        description: 'سلسلة السيرة النبوية -الدرس الثالث الجزء الثاني- وصف النبي صلي الله عليه وسلم وزواجه من السيدة خديجة'
      },
      { 
        title: 'الدرس الرابع- نزول الوحي علي النبي والدعوة السرية بمكة', 
        id: '6SiKw-qQ6mk',
        description: 'سلسلة السيرة النبوية -الدرس الرابع- نزول الوحي علي النبي والدعوة السرية بمكة'
      },
      { 
        title: 'الدرس الخامس- بداية الجهر بالدعوة', 
        id: 'GLvr-pYGLOs',
        description: 'سلسلة السيرة النبوية -الدرس الخامس- بداية الجهر بالدعوة'
      },
      { 
        title: 'سلسلة السيرة النبوية -الدرس السادس- بداية فترة استضعاف المسلمين في مكة والهجرة إلي الحبشة', 
        id: 'aliwSuClQRI',
        description: 'سلسلة السيرة النبوية -الدرس السادس- بداية فترة استضعاف المسلمين في مكة والهجرة إلي الحبشة'
      },
      { 
        title: 'الدرس السابع- إسلام عمر بن الخطاب ووفاة أبو طالب عم النبي', 
        id: 'dZ1EkPuj91w',
        description: 'سلسلة السيرة النبوية -الدرس السابع- إسلام عمر بن الخطاب ووفاة أبو طالب عم النبي'
      },
      { 
        title: 'الدرس الثامن- عام الحزن ورحلة النبي صلي الله عليه وسلم إلي الطائف', 
        id: 'Tl1NmCYk1G4',
        description: 'سلسلة السيرة النبوية -الدرس الثامن- عام الحزن ورحلة النبي صلي الله عليه وسلم إلي الطائف'
      },
      { 
        title: 'الدرس التاسع- رحلة الإسراء والمعراج', 
        id: 'mvwhozvTKd8',
        description: 'سلسلة السيرة النبوية -الدرس التاسع- رحلة الإسراء والمعراج'
      },
      { 
        title: 'الدرس العاشر- الطواف علي القبائل وبيعة العقبة الأولي', 
        id: 'SlBo6bmtuTI',
        description: 'سلسلة السيرة النبوية -الدرس العاشر- الطواف علي القبائل وبيعة العقبة الأولي'
      },
      { 
        title: 'الدرس الحادي عشر- أحداث الهجرة إلي المدينة', 
        id: 'GGFse7G6cAs',
        description: 'سلسلة السيرة النبوية -الدرس الحادي عشر- أحداث الهجرة إلي المدينة'
      },
      { 
        title: 'الدرس الثاني عشر- بداية العهد المدني وتأسيس مدينة للمسلمين', 
        id: '3rzbyI2_cvc',
        description: 'سلسلة السيرة النبوية -الدرس الثاني عشر- بداية العهد المدني وتأسيس مدينة للمسلمين'
      },
      { 
        title: 'الدرس الثالث عشر- مجتمع المدينة ومفهوم الجهاد في سبيل الله', 
        id: '7spRnIahHk4',
        description: 'سلسلة السيرة النبوية -الدرس الثالث عشر- مجتمع المدينة ومفهوم الجهاد في سبيل الله'
      },
      { 
        title: 'الدرس الرابع عشر- غزوة بدر', 
        id: 'b7YVYhcQdfU',
        description: 'سلسلة السيرة النبوية -الدرس الرابع عشر- غزوة بدر'
      },
      { 
        title: 'الدرس الخامس عشر- أحداث ما بين بدر وأحد', 
        id: 'Pt2EEsFtf5Y',
        description: 'سلسلة السيرة النبوية -الدرس الخامس عشر- أحداث ما بين بدر وأحد'
      },
    ]
  }
];
